Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །ཚུལ་ཁྲིམས་ཉོན་མོངས་ཞི་བ་བཟོད་པ་མི་འཚིག་པ།
en: Their conduct is the pacification of the kleśas; their patience is to not be harmful.

source: །བརྩོན་འགྲུས་དེ་ནས་ཁྱད་པར་གོང་དུ་རྩོམ་པ་སྟེ།
en: Their diligence is undertaking that which is even higher.

source: །ལམ་ལས་མི་སྒུལ་དེ་ནི་ལེགས་ལྡན་བསམ་གཏན་ནོ།
en: The meditation of those endowed with good qualities is not deviating from the path.

source: །མི་སྐྱེའི་བཟོད་པ་རྡུལ་མེད་མཁས་པའི་ཤེས་རབ་མཆོག །ད་དུང་མངོན་འདོད་སྔོ་བ་དེ་ཡི་སྨོན་ལམ་སྟེ།
en: “The highest excellent wisdom is their stainless acceptance of birthlessness. Their prayer is to long for more through the method of dedication.

source: །མི་ཐུབ་སྟོབས་ཡིན་ཤིན་ཏུ་རྟོགས་པ་ཡེ་ཤེས་སོ།
en: Their power is invincibility; their knowledge is from complete certainty.

source: །དེ་ལྟར་བྱང་ཆུབ་ཡོན་ཏན་ཐམས་ཅད་སྐད་ཅིག་ལྡན།
en: In that way all the qualities of enlightenment are present in each instant.

source: །དང་པོར་དམིགས་པས་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: “On the first, the qualities are completed through intention;

source: །གཉིས་ལ་དྲི་མ་བསྩལ་ཕྱིར་གསུམ་ལ་བགེགས་བསྩལ་བས།
en: On the second, by removing stains; on the third, by cutting through impediments;

source: །བཞི་ལ་ལམ་གྱིས་ལྔ་ལ་མཉམ་པ་ཉིད་ཀྱིས་ཏེ།
en: On the fourth, by the path; on the fifth, through suitable activity;

source: མི་སྐྱེའི་སྣང་བས་མཁས་པའི་དྲུག་པོ་རྣམ་པར་འཕེལ།
en: On the sixth, by the wise ones increasing that which is called birthlessness

source: །བདུན་པོ་འདིར་ཕྱིན་ཡོན་ཏན་མཐའ་དག་ཀུན་རྫོགས་པར།
en: “On this seventh bhūmi all the qualities are attained,

source: །སྨོན་ལམ་དུ་མ་སྣ་ཚོགས་མངོན་པར་བསྒྲུབ་པ་བྱེད།
en: And various numerous aspirations are fulfilled.

source: །ཅི་ཕྱིར་ཞེ་ན་ཡེ་ཤེས་སྤྱོད་པ་འདིར་གྲུབ་པ།
en: Why is that? Because they reach the conduct of wisdom,

source: །དེ་ནི་བརྒྱད་པ་ཡན་ཅད་ཀུན་ཏུ་རྣམ་དག་འགྱུར།
en: Which they will completely purify in continuing on the eighth.

source: །འདའ་དཀའ་ཕྱིན་དཀའ་ཡེ་ཤེས་མང་པོའི་ལས་ཀྱིས་འགྲུབ།
en: “It is difficult to ascend to, difficult to reach, and requires many activities,

source: །ཞིང་གཉིས་བར་མཚམས་ཇི་ལྟར་ཡོངས་སུ་བརྒལ་དཀའ་བཞིན།
en: Like crossing the space between two realms.

source: །བདུན་ལ་སྤྱོད་པ་རྒྱལ་པོ་ཆགས་མེད་ཇི་བཞིན་ཏེ།
en: Conduct on the seventh is like an untarnished sovereign.

source: །ལམ་ལ་གནས་པ་ཡིན་གྱི་ཐམས་ཅད་བརྟན་མ་འདས།
en: They remain on the path but do not have enduring transcendence.

source: །བརྒྱད་པའི་ཡེ་ཤེས་ས་དང་གང་ཚེ་ལྡན་གྱུར་པ།
en: “When they reach the eighth, the bhūmi of wisdom,

source: །དེ་ཚེ་སེམས་ཀྱི་ཡུལ་འདས་ཡེ་ཤེས་ལས་ལ་གནས།
en: They transcend the mind’s scope and remain in the activity of wisdom.

source: །ཚངས་པ་འགྲོ་བ་ལྟ་ཡང་མི་ཡི་བདག་ཉིད་མིན།
en: When Brahmā looks at beings he is not a human being.

source: །དེ་བཞིན་མཁས་པ་པད་མོ་བཞིན་དུ་མི་ཆགས་སྤྱོད།
en: In that way the wise act like unstained lotuses.

source: །འདི་ལ་གནས་པ་ཉོན་མོངས་སྣ་ཚོགས་རབ་ཏུ་འདའ།
en: “Residing there they transcend the various kleśas.

source: །དེ་དག་ཉོན་མོངས་སྤྱོད་མེད་བྱང་བ་འང་ཐོབ་པ་མིན།
en: They do not have the conduct of the kleśas but have not eliminated them.

source: །ལམ་ལ་གནས་ཀྱང་དེ་འདྲའི་ཉོན་མོངས་སྤྱོད་མེད་མིན།
en: While following the path their conduct is not that of the kleśas,

source: །རྒྱལ་བའི་ཡེ་ཤེས་མངོན་འདོད་དེ་བས་ཟད་པ་མིན།
en: But they are not eliminated, and their wish for the wisdom of the jinas is not fulfilled.

source: །འཇིག་རྟེན་བཟོ་དང་ལས་གནས་རྣམ་པ་སྣ་ཚོགས་དག །མཁས་པས་གཙུག་ལག་རྒྱུས་ལ་གནས་ཏེ་ཤེས་བྱས་དང་། །བསམ་གཏན་མངོན་ཤེས་སྟོབས་བསྒོམས་ལྡན་པར་གྱུར་པ་རྣམས།
en: “They are engaged in various worldly activities and skills. Through being wise in all knowledge they are learned. They attain through cultivation the power of meditation and clairvoyance.

source: དེ་བས་གསལ་འགྱུར་ཏིང་འཛིན་སྣ་ཚོགས་མངོན་པར་སྒྲུབ།
en: They accomplish an even greater variety of samādhis.

source: །ཉན་ཐོས་རང་རྒྱལ་སྤྱོད་ལས་ཡོངས་སུ་འདས་པ་སྟེ།
en: “They surpass the conduct of the śrāvakas and also the pratyekabuddhas.

source: །བདུན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ལ་མཁས་པ་གནས།
en: The wise are established in the limitless conduct of the bodhisattva,

source: །སྔོན་ཆད་བསམ་པས་ཡིན་གྱི་འདི་ལ་ཡེ་ཤེས་ཀྱིས།
en: Previously through intention but here through wisdom,

source: །ནར་སོན་མཐུ་དང་ལྡན་པའི་རྒྱལ་པོའི་བུ་བཞིན་ནོ།
en: Like a prince who has gained power through growing up.

source: །ཤིན་དུ་ཟབ་དང་ལྡན་པས་གོང་དུ་རྩོམ་བྱེད་དེ།
en: “Having reached the profound, they undertake even more.

source: །འགོག་པའི་སེམས་དང་ལྡན་ཡང་མངོན་པར་མི་བྱེད་དོ།
en: Their minds have reached cessation but do not actualize it,

source: །ཇི་ལྟར་རྒྱ་མཚོར་ཕྱིན་ཞིང་གྲུ་ཆེན་ཞུགས་གྱུར་པ།
en: Just as when sailing on the ocean in a great ship

source: །ཆུ་ཚུལ་ཐམས་ཅད་མངོན་གྱུར་གྲུ་ལ་སྐྱོན་མི་འགྱུར།
en: With direct knowledge of all its water, the ship is not sunk.

source: །དེ་དག་སྔོན་བས་ཐབས་དང་ཤེས་རབ་མཆོག་དང་ལྡན།
en: “They have greater attainment of the power of method and of wisdom.

source: །ཤེས་དཀའ་འགྲོ་བ་ཀུན་ཏུ་ཤེས་སྤྱོད་ཡོན་ཏན་མང་།
en: They are wealthy in the qualities of wisdom and action that beings cannot comprehend.

source: །སངས་རྒྱས་བྱེ་བ་ཡང་དུ་བསམ་པ་དག་པས་མཆོད།
en: In a pure state, they make offerings to myriad buddhas.

source: །གསེར་སྦྲམ་དེ་ཉིད་རིན་ཆེན་མང་པོས་སྤྲས་པ་བཞིན།
en: They are like gold beautifully adorned by many jewels.

source: །འདི་ལ་གནས་པའི་མཁས་པའི་ཤེས་རབ་མཆོག་གི་འོད།
en: “The wise ones on that bhūmi have the radiance of supreme wisdom.

source: །སྲེད་པའི་ཆུ་རྣམས་ཇི་ལྟར་གཉི་བཞིན་ཡོངས་སུ་སྐེམ།
en: They dry up the water of craving just as sunlight does.

source: །ས་མཆོག་འདི་ལ་གནས་པ་དབང་སྒྱུར་རྒྱལ་པོར་འགྱུར།
en: Those who have reached this bhūmi become Vaśavartin.

source: །ཡེ་ཤེས་དམ་པའི་འབྲས་བུ་སྟོན་ལ་མཐུ་ཡོད་མཁས།
en: They are powerful and skilled through teaching the result of goodness and wisdom.

source: །འདོད་ན་བརྩོན་འགྲུས་དམ་པའི་སྟོབས་དང་ལྡན་གྱུར་པ།
en: “They attain the power of the enduring diligence that they wish for.

source: །སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚང་བ་དག །ཕྱོགས་རྣམས་ཀུན་ཏུ་ཤིན་ཏུ་མཉམ་པར་བཞག་པས་མཐོང་།
en: In meditation they see a quintillion buddhas In all directions, and from then on

source: །ཡན་ཅད་སྨོན་ལམ་ཡོན་ཏན་མཆོག་ཅན་ཚད་ཀྱང་མེད།
en: They have more limitless excellent qualities from prayer.

source: །འདི་ནི་ས་མཆོག་བདུན་པ་སྟེ། །རང་རྒྱལ་དབང་ལ་སྤྱོད་པ་དང་། །འཇིག་རྟེན་ཀུན་གྱིས་ཤེས་པར་དཀའ།
en: “This is the seventh bhūmi,

source: །ཐབས་དང་ཤེས་རབ་སྦྱོར་བའོ།
en: Where they are purified by method and wisdom.

source: །རིང་དུ་སོང་བ་ཞེས་བྱ་བ་སྟེ།
en: It cannot be comprehended by beings Or by the power of pratyekabuddha conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པའོ།།
en: “This is the seventh bhūmi of the bodhisattva,

source: །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཅྭོ་བརྒྱད་པ།
en: Which is named Gone Far.”

source: མཁས་པའི་སྤྱོད་པ་དེ་འདྲ་དམ་པ་ཐོས་ནས།
en: Having heard that sublime conduct of the wise,

source: །ལྷ་ཡི་ཚོགས་དང་ལྷའི་དབང་པོ་ཀུན་དགའ།
en: The lord of the deities and the assembly of devas rejoiced,

source: །བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་ཕན་བརྩོན་པ་མང་པོ།
en: Saying, “Bodhisattva, you are a benefit to beings,”

source: །བདེ་བར་གཤེགས་དང་རྒྱལ་སྲས་རྣམས་ལ་མཆོད་བྱེད།
en: And they made offerings to the sugata and jinaputras.

source: །མེ་ཏོག་ཕྲེང་བ་རྒྱལ་མཚན་བ་དན་ཡིད་འོང་།
en: They poured down flower garlands and beautiful banners, flags,

source: །སྤོས་དང་ཕྱེ་མ་རིན་ཆེན་ན་བཟའ་རྒྱན་པ།
en: And incense powders, beautiful clothing and adornments,

source: །དབྱིག་གིས་སྤྲས་པའི་གདུགས་རབ་ཁྲག་ཁྲིག་དུ་མ།
en: Countless beautiful parasols adorned with jewels,

source: །ཕྲེང་བའི་སྤྲིན་ཀྱི་དམ་པའི་ཆར་ཡང་མངོན་འབེབས།
en: And wonderful clouds of strings of pearls.

source: ལྷའི་བུ་མོས་ཡིད་དུ་འོང་བའི་སྒྲ་དབྱངས།
en: Goddesses with delightful sweet voices

source: །དུ་མའི་སིལ་སྙན་གར་གྱི་མཆོག་དང་ལྡན་བྱས།
en: Played innumerable musical instruments and danced beautifully,

source: །བདེ་བར་གཤེགས་དང་རྒྱལ་སྲས་མཆོད་པའི་དོན་དུ།
en: And as an offering to the sugata and jinaputras,

source: །ཐུབ་པའི་ཡོན་ཏན་རྨད་དུ་བྱུང་བ་རྗོད་བྱེད།
en: They described the excellent qualities of the Muni:

source: །ཐམས་ཅད་གཟིགས་པ་རྐང་གཉིས་ཁྱུ་མཆོག་གཙོ་བོ།
en: “The all-seeing supreme one, the best of humans,

source: །སངས་རྒྱས་སྤྱོད་ཡུལ་འགྲོ་ལ་ཕན་ཕྱིར་སྟོན་མཛད།
en: Who reveals the Buddha’s field of activity in order to benefit beings.

source: །དབྱངས་སྤྲིན་ཡིད་དུ་འོང་བ་རབ་ཏུ་འབྱུང་བའི།
en: A beautiful cloud of music perfectly arises

source: །རྔ་དང་སིལ་སྙན་སྣ་ཚོགས་རྣམས་ལས་འདི་འབྱུང་།
en: From this variety of musical instruments and drumming.

source: །སྐྲ་ཡི་རྩེ་ལ་བདེ་གཤེགས་བརྒྱ་ཕྲག་སྟོང་སྙེད།
en: “There are trillions of sugatas on the tip of a hair,

source: །གང་གླུ་ཁྲག་ཁྲིག་བྱེ་བའི་རྡུལ་བས་དེ་མང་།
en: As numerous as the sand grains in ten trillion Ganges Rivers.

source: །ཞིང་མཆོག་དམ་པ་མཉམ་པ་མེད་པ་དག་ན།
en: They are peaceful, unequaled, and supremely excellent.

source: །ཁྱུ་མཆོག་རྣམས་ནི་རྡུལ་བྲལ་ཆོས་རྣམས་སྟོན་མཛད།
en: These lords teach the stainless Dharma.

source: །སྤུ་གཅིག་རྩེ་ལ་འབྱམ་ཀླས་དམ་པའི་ཞིང་མང་།
en: “On the tip of a single body-hair there are infinite realms

source: །གླིང་བཞི་དུ་མ་རྒྱ་མཚོ་མཚོ་ཆེན་ཀུན་གནས།
en: In which there are a multitude of four continents, great oceans,

source: །ཁོར་ཡུག་བྱེ་བ་དེ་བཞིན་རི་རབ་ཐམས་ཅད།
en: Millions of encircling mountains, and the same number of Sumeru Mountains,

source: །སོ་སོའི་ཚུལ་དང་ལྡན་པར་ཀུན་ཀྱང་སྣང་གྱུར།
en: All appearing in accordance with their own nature.

source: །སྐྲ་ཡི་རྩེ་མོ་དེ་ལ་འགྲོ་རྒྱུད་དྲུག་པོ།
en: “On the tip of each hair of the head are the six classes of beings:

source: །ཡི་དགས་བྱོལ་སོང་མི་དང་སེམས་དམྱལ་ལྷ་དང་། །གནོད་སྦྱིན་སྲིན་པོ་ཀླུ་དང་ལྷ་མིན་མང་པོ།
en: Pretas, animals, hell beings, humans, and devas And assemblies of yakṣas, rākṣasas, nāgas, and asuras,

source: །སྣ་ཚོགས་ལས་ཀྱི་ཡུལ་ལ་ཀུན་ཀྱང་སྤྱོད་བྱེད།
en: Who are experiencing the realms of diverse karma.

source: །རྡུལ་བྲལ་ཀུན་གྱི་ཞིང་གི་སྤྱོད་ཡུལ་ཀུན་ཏུ།
en: “In all the world realms of those cleansed of impurities,

source: །འཁོར་ལོ་དམ་པའི་མཆོག་ཀྱང་དེ་ཚེ་འཁོར་གྱུར།
en: The supremely excellent wheel is turned. The sugatas teach with beautiful voices,

source: །འགྲོ་བའི་འདུ་ཤེས་སེམས་དང་དེ་བཞིན་སྤྱོད་པ། །བདེ་གཤེགས་གསུང་གི་དམ་པས་ཀུན་ཀྱང་བསྟན་བྱས།
en: Acting in accordance with the perceptions and minds of beings.

source: །སེམས་ཅན་ལུས་ལ་བདེ་གཤེགས་ཞིང་མང་སྣ་ཚོགས།
en: The sugatas, in various realms, in the bodies of those beings,

source: །ཞིང་ལ་སེམས་ཅན་རྨད་སྙེད་ལུས་ཀྱང་དེ་བཞིན།
en: Ripen the higher beings in those realms.

source: །ལྷ་དང་མི་ཡི་ལམ་རྒྱུད་དེ་བཞིན་སྣ་ཚོགས།
en: Knowing the various existences of devas and humans,

source: །མཁྱེན་ནས་བདེ་བར་གཤེགས་པ་ཆོས་རྣམས་ཀུན་སྟོན།
en: All the sugatas teach them the Dharma.

source: །ཤིན་ཏུ་ཡངས་པའི་ཞིང་ལ་འདུ་ཤེས་ཕྲར་གྱུར།
en: A vast realm is perceived as minute,

source: །རྡུལ་གྱི་མཚན་མ་དག་ལ་འདུ་ཤེས་ཡངས་གྱུར།
en: And a speck of dust is perceived as vast.

source: །དེ་ལས་སྩོགས་པ་བདེ་བར་གཤེགས་པའི་རྫུ་འཕྲུལ།
en: These and others are the miracles of the sugatas.

source: །འཇིག་རྟེན་ཀུན་གྱི་བརྗོད་ཀྱང་ཟད་པར་མི་འགྱུར།
en: Even if the entire world were to describe them, they could not finish.”

source: །ཆེ་བ་ཉིད་དབྱངས་དེ་སྐད་དུ།
en: The beautiful song described

source: །སྙན་པའི་དབྱངས་སུ་གྲག་གྱུར་ནས།
en: This greatness in these words.

source: །འཁོར་རྣམས་རབ་ཏུ་དགའ་ཞིང་ཞི།
en: The assembly, pleased and at peace,

source: །གསུང་བའི་མཆོག་ལ་ལྟ་ཞིང་གནས།
en: Gazed upon the supreme among speakers.

source: །འཁོར་རྣམས་ཞི་བར་ཤེས་གྱུར་ནས།
en: Observing that the assembly was becalmed,

source: །ས་བརྒྱད་པ་ཡི་རྣམ་པ་དང་། །དེ་ལ་འཇུག་པ་བསྟན་པར་མཛོད།
en: “Teach the nature of the eighth bhūmi And also how it is entered.”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ། །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: The bodhisattva Vajra­garbha said, “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་ལ་རྣམ་པར་དབྱེ་བ་ཤིན་ཏུ་བྱས་པ། ཐབས་དང་ཤེས་རབ་ཀྱིས་ལམ་ཤིན་ཏུ་སྦྱངས་པ།
en: In that way the bodhisattva has perfectly analyzed seven bhūmis. He has purified the path through method and wisdom.

source: ཚོགས་ཤིན་ཏུ་བསྩགས་པ།
en: He has perfectly accumulated the accumulations.

source: སྨོན་ལམ་ཆེན་པོ་ཤིན་ཏུ་བཏབ་པའི་སྟོབས་དང་ཤུགས་ཅན། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་དུ་རླབས་པ་རང་གི་དགེ་བའི་རྩ་བའི་སྟོབས་དང་ཤུགས་ཐོབ་པ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་དང་ལྡན་པ། བསམ་པ་དང་ལྷག་པའི་བསམ་པས་ཡོངས་སུ་སྦྱངས་བའི་སེམས་དང་ལྡན་པ། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་མངོན་པར་འཕགས་པ། སྙིང་རྗེ་དང་སྙིང་བརྩེ་བ་ཆེན་པོས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བའི་སྦྱོར་བ་དང་ལྡན་པ།
en: He has perfectly made great prayers. He has been blessed by the blessings of the tathāgatas. He has gained the strength of his own roots of goodness. His mind is focused on the strengths, confidences, and unique qualities of the tathāgatas. He has a perfectly purified higher motivation and intention. He has risen through the strength of merit and wisdom. He has become engaged in never forsaking any being, because of his great compassion and kindness, and he follows the path of immeasurable wisdom.

source: ཡེ་ཤེས་ཀྱི་ལམ་ཚད་མེད་པའི་རྗེས་སུ་སོང་བ་དེ་ཆོས་ཐམས་ཅད་ཐོག །མ་ནས་མ་བྱུང་བ་ཉིད་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་གོ །མ་སྐྱེས་པ་དང་། མཚན་ཉིད་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འཇིག་པ་མེད་པ་དང་། ཐུག་པ་མེད་པ་དང་། མི་རྒྱུ་བ་དང་། མི་ལྡོག་པ་དང་། དངོས་པོ་མེད་པའི་རང་བཞིན་དང་། ཐོག་མ་དང་ཐ་མ་དང་དབུས་མཉམ་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱིས་རྣམ་པར་མི་རྟོག་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་འང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་སྟེ།
en: He correctly comprehends the primordial nonarising of all phenomena. He comprehends birthlessness, featurelessness, nonorigination, nondestruction, noncompletion, nondevelopment, nonreversal, the nature of nonexistence, the equality of beginning, middle, and end, and entry into the nonconceptual omniscient wisdom of the true nature of all phenomena exactly as they are.

source: དེས་རྣམ་པ་ཐམས་ཅད་དུ་སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པའི་རྣམ་པར་རྟོག་པ་དང་། འདུ་ཤེས་དང་བྲལ་ཞིང་ཐོགས་པ་མེད་ལ་ནམ་མཁའ་དང་འདྲ་ཞིང་ནམ་མཁའི་རང་བཞིན་དུ་ཁོང་དུ་ཆུད་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ཅེས་བྱའོ།
en: It is said that he is always free from the conceptualizing thoughts of mind, mentation, and consciousness, that he is unimpeded, that he is the same as space, that he has the nature of open space, and that he has attained the acceptance of the birthlessness of phenomena. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་དེ་ལྟ་བུའི་བཟོད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་ཐོབ་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་གནས་ཟབ་མོ་ཤེས་པར་དཀའ་བ་ཐ་མི་དད་པ་མཚན་མ་ཐམས་ཅད་དང་བྲལ་བ་འདུ་ཤེས་ཀྱི་བགེགས་ཐམས་ཅད་ལས་ཕྱིར་ལོག་པ་ཚད་མེད་པ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ། དབེན་པ་ཐམས་ཅད་མངོན་དུ་གྱུར་པ། ཤིན་ཏུ་ཐོབ་པ་ཡིན།
en: As soon as the bodhisattva who has that kind of acceptance attains the bodhisattva bhūmi Unwavering, he attains a profound bodhisattva state that is difficult to understand, is unadulterated, is devoid of all features, excludes all impeding conceptual identification, is limitless, is unsurpassable by all śrāvakas and pratyekabuddhas, and has the outlook of nonattachment to everything.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན།
en: “O jinaputras!

source: དགེ་སློང་རྫུ་འཕྲུལ་དང་ལྡན་པ་སེམས་ཀྱི་དབང་དམ་པའི་ཕ་རོལ་ཏུ་བགྲོད་པར་ཕྱིན་པ་མཐར་གྱིས་འགོག་པའི་བར་དུ་མཉམ་པར་བཞག་པ་ནི་རྒྱུ་བ་དང་སེམས་པ་དང་། གཡོ་བའི་རྣམ་པར་རྟོག་པ་དང་། འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བ་ཡིན།
en: To give an analogy, it is like a bhikṣu with miraculous powers who has through stages attained the cessation that is the ninth stage of dhyāna and is devoid of conceit and the flow of thoughts.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་མི་གཡོ་བ་འདི་ཐོབ་མ་ཐག་ཏུ་ཆེད་དུ་བྱ་བ་ཐམས་ཅད་དང་བྲལ་ཏེ་ལྷུན་གྱིས་གྲུབ་པའི་ཆོས་ཉིད་ཐོབ་ཅིང་ལུས་དང་ངག་དང་སེམས་ཀྱི་རྩོལ་བ་ཐམས་ཅད་དང་བྲལ་ཏེ་ཤིན་ཏུ་དབེན་པའི་ཆོས་ཉིད་ལ་གནས་པ་ཡིན།
en: “O jinaputras! In that same way, as soon as the bodhisattva has attained the bodhisattva bhūmi Unwavering, he is devoid of all effort and effortlessly attains the true nature, free from all physical, vocal, and mental striving, and is devoid of conceit and the flow of thoughts and remains in the detached state of the true nature.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “O jinaputras!

source: མི་ལ་ལ་ཞིག་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་དུ་བདག་ཆུ་ཀླུང་ཆེན་པོས་ཁྱེར་བ་སྙམ་བྱེད་ལ། དེ་དེ་ནས་ཅི་ཕྱིན་ཏུ་འབད་ཅིང་རྩོལ་བ་ཆེན་པོ་རྩོམ་རྩོམ་པ་ལས་དེ་འབད་ཅིང་རྩོལ་བ་ཆེན་པོ་དེ་ཉིད་ཀྱིས་སད་པར་གྱུར་ན།
en: To give an analogy, it is like a sleeping person who in a dream sees himself swept away by a great flood and commences to strive and exert himself in order to save himself. Because of that very striving and exertion he wakes up, and when he has completely woken up, all the striving and exertion ceases. “O jinaputras!

source: དེ་སད་མ་ཐག་ཏུ་འབད་ཅིང་རྩོལ་བ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ། །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཉོན་མོངས་པའི་ཆུ་ཀླུང་ཆེན་པོ་བཞིར་སེམས་ཅན་མང་པོ་དོང་བར་ཤེས་ནས་འབད་ཅིང་རྩོལ་བ་ཡོངས་སུ་རྩོམ་མོ། །དེ་བརྩོན་འགྲུས་ཆེན་པོ་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་འདི་ཐོབ་མ་ཐག་ཏུ་ཆེད་དུ་བྱ་བ་ཐམས་ཅད་བྲལ་བ་ཡིན་ཏེ།
en: In the same way, the bodhisattva perceives that the multitude of beings are swept away by the four great floods of the kleśas, and he commences to strive and exert himself greatly for liberation, for omniscient wisdom’s enlightenment. When he has commenced upon great diligence and has completely attained this bodhisattva bhūmi Unwavering, all effort ceases.

source: དེའི་གཉིས་པོ་རྒྱུ་བ་འམ། མཚན་མ་རྒྱུ་བ་དག་ཀྱང་ཐམས་ཅད་དུ་མི་སྣང་བར་འགྱུར་རོ།
en: There no longer appears any dualistic conduct or conduct based on conceptions of the features of phenomena.

source: ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་ཤིང་གནས་པ་ནི་འདོད་པ་ལ་སྤྱོད་པའི་ཉོན་མོངས་པ་རྣམས་ཡོངས་སུ་མི་རྒྱུ་བ་ཡིན།
en: By analogy, if someone has been born and dwells in the Brahmā paradise, he does not engage in kleśas and the activity of desire. “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་མི་གཡོ་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་དང་ཡིད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་རྒྱུ་བ་རྣམས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཡོངས་སུ་མི་རྒྱུ་བ་ཡིན་ཏེ། དེ་སངས་རྒྱས་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ། བྱང་ཆུབ་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ།
en: In the same way, the bodhisattva who is on the bodhisattva bhūmi Unwavering has no engagement whatsoever in the activity of mind, mentation, and consciousness.

source: རང་སངས་རྒྱས་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ། ཉན་ཐོས་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ། མྱ་ངན་ལས་འདས་པ་ལ་ཡོངས་སུ་རྒྱུ་བའམ། དགྲ་བཅོམ་པ་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ། ཕྱིར་མི་འོང་བ་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ། ལན་ཅིག་ཕྱིར་འོང་བ་ལ་ཡོངས་སུ་རྒྱུ་བ་འམ།
en: There is not even engagement in any buddha activity, and there is no engagement in bodhisattva activity, no engagement in pratyekabuddha activity, no engagement in śrāvaka activity, no engagement in nirvāṇa activity, no engagement in the activity of an arhat, no engagement in the activity of a non-returner, no engagement in the activity of a once-returner, and no engagement in the activity of a stream entrant.

source: རྒྱུན་ཏུ་ཞུགས་པ་ལ་ཡོངས་སུ་རྒྱུ་བ་ཡང་ཡོངས་སུ་མི་རྒྱུ་ན་འཇིག་རྟེན་པའི་ཡོངས་སུ་རྒྱུ་བ་ཡོངས་སུ་མི་རྒྱུ་བ་ལྟ་ཅི་སྨོས།
en: It is therefore needless to say that there is no engagement in worldly activity.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་མི་གཡོ་བའི་ས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་དང་ཤུགས་ལ་གནས་པ་དེའི་ཆོས་ཀྱི་སྒོའི་རྒྱུད་དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱིས་ཉེ་བར་བསྒྲུབ་པ་མཛད་དེ།
en: “O jinaputras, in that way the bodhisattva who is on the bodhisattva bhūmi Unwavering, who continues in the strength of his previous prayers, has the flow of entrance into the Dharma in which the buddha bhagavats create the accomplishment of the wisdom of the tathāgatas.

source: དེ་ལ་འདི་སྐད་ཅེས་ཀྱང་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: They say to him, ‘Noble son, well done! Well done!

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྗེས་སུ་རྟོགས་པར་བྱ་བ་ལ་འདི་ནི་དོན་དམ་པའི་བཟོད་པའང་ཡིན་ན།
en: This ultimate patience is for attaining the Dharma of the Buddha.

source: འོན་ཀྱང་རིགས་ཀྱི་བུ་ངེད་ཀྱི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཕུན་སུམ་ཚོགས་པ་དེ་ཁྱོད་ལ་མེད་ཅིང་།
en: However, noble son, you do not have the accomplishment of the ten strengths, the four confidences, and the qualities of a buddha.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ཡོངས་སུ་བཙལ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམས་ཤིག །བཟོད་པའི་སྒོ་འདི་ཉིད་ཀྱང་མ་བཏོང་ཤིག །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: Dedicate yourself to seeking the accomplishment of the qualities of a buddha. Therefore, be diligent and do not abandon the entrance of acceptance.

source: ཁྱོད་ཀྱིས་དེ་ལྟར་ཞི་བའི་རྣམ་པར་ཐར་པ་ཐོབ་ཀྱང་། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འདི་དག་ཞི་བ་མ་ཡིན་རབ་ཏུ་ཞི་བ་མ་ཡིན་ཏེ། ཉོན་མོངས་པ་སྣ་ཚོགས་ཡོངས་སུ་རྒྱུ་བར་གྱུར་ན། དེ་ལྟར་རྣམ་པར་རྟོག་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་མནར་བ་ལ་སོམས།
en: ‘Noble son, you have attained the state of liberation into peace, but you must consider the childlike ordinary individuals who are not at peace, do not have deep peace, and are engaged in various kinds of conduct because of the kleśas, their minds distressed by a variety of concepts.

source: འདི་ལྟར་ཡང་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་སེམས་ཅན་ཀྱི་དོན་ཡོངས་སུ་འགྲུབ་པར་བྱ་བར་བཏབ་པ་དང་། ཡེ་ཤེས་ཀྱི་སྒོ་བསམ་གྱིས་མི་ཁྱབ་པ་དྲན་པར་གྱིས་ཤིག །འདི་ལྟར་ཡང་རིགས་ཀྱི་བུ་འདི་ནི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ།
en: ‘Also, noble son, remember your previous prayers, your dedication to benefiting beings, and the inconceivable entrance to wisdom. “ ‘Also, noble son, this is the true nature of phenomena.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་རུང་། ཆོས་ཀྱི་དབྱིངས་དང་ཆོས་ཀྱི་གནས་ཉིད་འདི་ནི་དེ་བཞིན་དུ་འདུག་པ་སྟེ། འདིས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཉི་ཙེ་བརྗོད་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: Whether the tathāgatas appear or not, this continues to be the true nature of phenomena, which is the emptiness of all phenomena, the inconceivability of all phenomena. This is not something that is revealed solely by the tathāgatas.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་རྣམ་པར་མི་རྟོག་པའི་ཆོས་ཉིད་འདི་འཐོབ་བོ།
en: All śrāvakas and pratyekabuddhas also attain this nonconceptual true nature.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ངེད་ཀྱི་ལུས་ཚད་མེད་པ་དང་། ཡེ་ཤེས་ཚད་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་དང་། ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་ཚད་མེད་པ་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་ཚད་མེད་པ་དང་། དབྱངས་ཀྱི་ཡན་ལག་རྣམ་པར་དག་པ་ཚད་མེད་པ་ལ་ལྟོས།
en: ‘Noble son, regard our immeasurable bodies, immeasurable wisdom, immeasurable buddha realms, immeasurable accomplishment of wisdom, immeasurable halos, and immeasurable aspects of pure speech.

source: ཁྱོད་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་མངོན་པར་བསྒྲུབ་པར་བྱ་དགོས་སོ།
en: You should attain this kind of accomplishment.

source: །འདི་ལྟར་རིགས་ཀྱི་བུ་གང་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་མི་རྟོག་པ་དེ་ནི་ཁྱོད་ཀྱི་སྣང་བ་གཅིག་པུར་ཟད་དེ། རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་སྣང་བ་ནི་འདི་འདྲ་སྟེ།
en: ‘Also, noble son, you have had one illumination, which is the illumination of nonconceptuality toward all phenomena.

source: ཡོངས་སུ་མཐའ་ཡས་པར་སོང་ལ་ཡོངས་སུ་མཐའ་ཡས་པར་བསྒྲུབ་པ་སྟེ། དེ་སྙེད་ཀྱི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས་ཀྱང་བགྲང་བར་དཀས།
en: However, these illuminations of the tathāgatas are infinite and accomplish the infinite and are infinitely interconnected. It would be difficult to count them all, even in a quintillion eons.

source: དེ་དག་ཐོབ་པར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབ་པ་སྐྱེད་ཅིག །འདི་ལྟར་ཡང་རིགས་ཀྱི་བུ་ཕྱོགས་བཅུའི་ཞིང་ཚད་མེད་པ་དང་། སེམས་ཅན་ཚད་མེད་པ་དང་། ཆོས་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ་ལྟོས་ཏེ། དེ་དག་ཐམས་ཅད་མ་ནོར་བར་བགྲང་བར་གྱིས་ཤིག་ཅེས་སྟེ།
en: You should give rise to the accomplishment of their attainment. “ ‘Also, noble son, look at the infinite realms in the ten directions, the infinite beings, and the infinite categories of the Dharma, and you should enumerate them and give rise to the accomplishment of their exact attainment.’
